---
kind: other
id: Properties.T:Autodesk.Revit.DB.LocationPoint
source: html/0646b234-5ada-87e9-461e-122af582f637.htm
---
# LocationPoint Properties

Identifies if the object is read-only or modifiable.